In [1]:
import pandas as pd,seaborn as sns,matplotlib.pyplot as plt,numpy as np

In [3]:
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [4]:
A = np.random.randint(-10,50,10)
A

array([ -1,   8,  37,  41,  -8, -10,  10,  42,  48,  41])

In [5]:
np.where(A<0,0,A)

array([ 0,  8, 37, 41,  0,  0, 10, 42, 48, 41])

In [6]:
np.where(A>20,20,A)

array([ -1,   8,  20,  20,  -8, -10,  10,  20,  20,  20])

In [7]:
B = np.random.randint(-20,50,size=(7,3))

In [8]:
B

array([[-19,  13,  21],
       [ 25,  33,  19],
       [ 19,  19,  47],
       [  0,   5,   6],
       [ 14,  37,  14],
       [ 19,  49,  -5],
       [ 34, -11,  27]])

In [9]:
temp  = pd.DataFrame(B,columns=['v1','v2','v3'])
temp

   v1  v2  v3
0 -19  13  21
1  25  33  19
2  19  19  47
3   0   5   6
4  14  37  14
5  19  49  -5
6  34 -11  27

In [10]:
np.where(temp['v3']<0,0,temp['v3'])

array([21, 19, 47,  6, 14,  0, 27])

In [11]:
temp['v4']= np.where(temp['v3']<0,0,temp["v3"])

In [12]:
temp

   v1  v2  v3  v4
0 -19  13  21  21
1  25  33  19  19
2  19  19  47  47
3   0   5   6   6
4  14  37  14  14
5  19  49  -5   0
6  34 -11  27  27

In [14]:
df = pd.read_csv('bank_data.csv',sep=';')
df.head(3)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no

In [15]:
df['balance'].describe().round(2)

count     4521.00
mean      1422.66
std       3009.64
min      -3313.00
25%         69.00
50%        444.00
75%       1480.00
max      71188.00
Name: balance, dtype: float64

In [16]:
df['balance'].describe([0.01,0.05,0.1,0.9,0.95,0.99]).round(2)

count     4521.00
mean      1422.66
std       3009.64
min      -3313.00
1%        -671.40
5%        -162.00
10%          0.00
50%        444.00
90%       3913.00
95%       6102.00
99%      14194.60
max      71188.00
Name: balance, dtype: float64

In [17]:
capping_threshold = 14200
flooring_threshold = -700

In [18]:
np.where(df['balance']>14200,14200,df['balance'])

array([1787, 4789, 1350, ...,  295, 1137, 1136], dtype=int64)

In [19]:
df['bal_new'] = np.where(df['balance']>14200,14200,df['balance'])

In [20]:
df['bal_new'].describe([0.01,0.05,0.1,0.9,0.95,0.99]).round(2)

count     4521.00
mean      1352.09
std       2429.23
min      -3313.00
1%        -671.40
5%        -162.00
10%          0.00
50%        444.00
90%       3913.00
95%       6102.00
99%      14178.60
max      14200.00
Name: bal_new, dtype: float64

In [21]:
df['bal_new'] = np.where(df['bal_new']<-700,-700,df['bal_new'])

In [23]:
df['bal_new'].describe([0.01,0.05,0.1,0.9,0.95,0.99]).round(2)

count     4521.00
mean      1355.50
std       2425.68
min       -700.00
1%        -671.40
5%        -162.00
10%          0.00
50%        444.00
90%       3913.00
95%       6102.00
99%      14178.60
max      14200.00
Name: bal_new, dtype: float64

In [24]:
df['balance']<-700

0       False
1       False
2       False
3       False
4       False
        ...
4516    False
4517     True
4518    False
4519    False
4520    False
Name: balance, Length: 4521, dtype: bool

In [28]:
conditions = [df['balance']<-700,df['balance']>14200]
labels = [-700,14200]
df['balance_corrected'] = np.select(conditions,labels,df['balance'])
df['balance_corrected'].describe([0.01,0.5,0.1,0.9,0.95,0.99]).round(2)

count     4521.00
mean      1355.50
std       2425.68
min       -700.00
1%        -671.40
10%          0.00
50%        444.00
90%       3913.00
95%       6102.00
99%      14178.60
max      14200.00
Name: balance_corrected, dtype: float64